app/controllers/action_items_controller.rb

SELECT "action_items".* FROM "action_items"
---
  def index
    @action_items = ActionItem.all

SELECT "action_items".* FROM "action_items" WHERE ("action_items"."id" = 1) LIMIT 1
---
  def show
    @action_item = ActionItem.find(params[:id])

SELECT "lists".* FROM "lists" WHERE ("lists"."id" = 1) LIMIT 1
---
  def new
    @action_item = ActionItem.new
    @list = List.find(params[:list_id])

SELECT "action_items".* FROM "action_items" WHERE ("action_items"."id" = 3) LIMIT 1
SELECT "lists".* FROM "lists" WHERE ("lists"."id" = 1) LIMIT 1
---
  def edit
    @action_item = ActionItem.find(params[:id])
    @list = List.find(params[:list_id])

INSERT INTO "action_items" ("completed_at", "context", "created_at", "description", "due_date", "is_complete", "list_id", "name", "updated_at", "user_id") VALUES (NULL, 'Home', '2010-08-17 01:31:40.838419', 'Test', NULL, NULL, NULL, 'Testing 123', '2010-08-17 01:31:40.838419', 1)
---
  def create
    @action_item = ActionItem.new(params[:action_item])
    @action_item.list_id = params[:list_id]
    @action_item.user = current_user

    respond_to do |format|
      if @action_item.save

SELECT "action_items".* FROM "action_items" WHERE ("action_items"."id" = 6) LIMIT 1
UPDATE "action_items" SET "due_date" = '2010-08-30', "updated_at" = '2010-08-17 02:17:05.480600' WHERE ("action_items"."id" = 6)
---
  def update
    @action_item = ActionItem.find(params[:id])

    respond_to do |format|
      if @action_item.update_attributes(params[:action_item])

SELECT "action_items".* FROM "action_items" WHERE ("action_items"."id" = 1) LIMIT 1
DELETE FROM "action_items" WHERE ("action_items"."id" = 2)
---
  def destroy
    @action_item = ActionItem.find(params[:id])
    @action_item.destroy