app/controllers/calendars_controller.rb

SELECT "action_items".* FROM "action_items"
---
  def index
    @action_items = ActionItem.all