app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE ("lists"."user_id" = 1)
---
  def index
    @lists = List.where(:user_id => current_user)

SELECT "lists"."id", "lists"."user_id", "lists"."name", "lists"."created_at", "lists"."updated_at" FROM "lists" WHERE ("lists"."id" = 1) LIMIT 1
---
  def show
    @list = List.where(:user_id => current_user)
                .where(:id => params[:id])
                .order("action_items.due_date DESC, action_items.name ASC")
                .includes(:action_items)
                .first()

SELECT "lists".* FROM "lists" WHERE ("lists"."user_id" = 1) AND ("lists"."id" = 1) LIMIT 1
---
  def edit
    @list = List.where(:user_id => current_user).find(params[:id])

INSERT INTO "lists" ("created_at", "description", "name", "updated_at") VALUES ('2010-06-08 03:07:01.940992', 'Tasks that need to be addressed next.', 'Next', '2010-06-08 03:07:01.940992')
---
  def create
    @list = List.new(params[:list])
    @list.user = current_user

    respond_to do |format|
      if @list.save

SELECT "lists".* FROM "lists" WHERE ("lists"."user_id" = 1) AND ("lists"."id" = 6) LIMIT 1
UPDATE "lists" SET "name" = 'Busypp', "updated_at" = '2010-08-26 02:54:13.603237' WHERE ("lists"."id" = 6)
---
  def update
    @list = List.where(:user_id => current_user).find(params[:id])

    respond_to do |format|
      if @list.update_attributes(params[:list])